master/cases/halle/2D/spray_4/ico_spray/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
52875
(
(0.0204412 1.57789e-12 6.09267)
(0.0448977 4.57544e-12 7.14048)
(0.0608553 2.36641e-11 7.65642)
(0.0624138 9.06838e-12 7.87525)
(0.0598572 3.35182e-12 7.96174)
(0.0563378 1.20697e-12 7.99471)
(0.0524928 4.82471e-13 8.00671)
(0.0485807 5.45841e-13 8.0107)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        flowRate        0.000319444;
        value           uniform (0 0 7.93335);
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
