master/cases/halle/2D/spray_4/ico_spray/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
52875
(
0.920718
0.202186
0.0395203
0.00814679
0.00220431
0.00107548
0.000915528
0.000935961
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    walls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
525
(
0.920718
0.876737
0.798769
0.763088
0.747749
0.739778
0.734749
0.73124
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
