master/cases/halle/2D/spray_4/ico_spray/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
52875
(
3.43946e-05
1.16735e-05
3.27123e-06
9.41626e-07
3.87511e-07
3.88959e-07
9.3344e-07
2.8632e-06
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 4.87875e-05;
    }
    walls
    {
        type            nutWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
525
(
0
0
0
0
0
0
0
0
...
)
;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
240
(
6.25793e-05
6.26067e-05
6.26592e-05
6.27324e-05
6.28272e-05
6.29453e-05
6.30883e-05
6.32583e-05
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
