master/cases/halle/2D/spray_4/ico_spray/constant/sprayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sprayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationSchemes
{
    U               cellPointFace;
    rho             cell;
    p               cell;
    T               cell;
}

subCycles       2;
dtInjection		1e-6;

atomizationModel        off;
//atomizationModel      LISA;

includeOscillation      off;
//breakupModel    TAB;
//breakupModel    ETAB;
//breakupModel    ReitzDiwakar;
breakupModel    off;

//injectorModel         constInjector;
//injectorModel         ChomiakInjector;
//injectorModel         definedInjector;
//injectorModel         pressureSwirlInjector;
injectorModel           hollowConeInjector;

collisionModel  off;

//evaporationModel saturateEvaporationModel;
//evaporationModel standardEvaporationModel;
evaporationModel off;

//heatTransferModel RanzMarshall;
heatTransferModel off;

dispersionModel off;

dragModel       standardDragModel;

wallModel       reflect;

specConstAtomizationCoeffs
{
    dropletNozzleDiameterRatio
    (
        0.4
    );
    sprayAngle
    (
        10
    );
}

TABCoeffs
{
    y0              0.0;
    yDot0           0.0;
    Cmu             10.0;
    Comega          8.0;
    WeCrit          12;
}

ETABCoeffs
{
    Cmu         10.0;
    Comega      8.0;
    WeCrit      12;
    k1          0.2;
    k2          0.2;
    WeTransition    100.0;
}

ReitzDiwakarCoeffs
{
    Cbag            6;
    Cb              0.785;
    Cstrip          0.5;
    Cs              10;
}

ReitzKHRTCoeffs
{
    B0              0.61;
    B1              40;
    Ctau            1;
    CRT             0.1;
    msLimit         0.2;
    WeberLimit      6;
}

trajectoryCoeffs
{
    cSpace          1;
    cTime           0.3;
}

standardDragModelCoeffs
{
    preReFactor     0.166667;
    ReExponent      0.666667;
    ReLimiter       1000;
    CdLimiter       0.44;
    Cdistort        2.632;
}

standardEvaporationModelCoeffs
{
    evaporationScheme explicit;
    preReScFactor   0.6;
    ReExponent      0.5;
    ScExponent      0.333333;
}

RanzMarshallCoeffs
{
    preRePrFactor   0.6;
    ReExponent      0.5;
    PrExponent      0.333333;
}

hollowConeInjectorCoeffs
{
    dropletPDF
    {
        //pdfType           exponential;
        pdfType         lognormal;

        lognormalPDF
        {
            minValue          10.0e-6;
            maxValue        120.0e-6;
			mu
			(
			2.28002142708
			2.27610184727
			2.29146025608
			2.33849319695
			2.46094557312
			2.73443407335
			3.04062336205
			3.13037458983
			3.18992315198
			3.2299791471
			);

			sd
			(
			0.334791681575
			0.309200160456
			0.348598215591
			0.411620008356
			0.539996492577
			0.588979578418
			0.570229964243
			0.562943566568
			0.50543624294
			0.448739417047
			);
        }
		
	
	RosinRammlerPDF
        {
            minValue        1e-06;
            maxValue        0.00015;
            d               ( 0.00015 );
            n               ( 3 );
        }
    }

    innerConeAngle
    (
        0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
		0.0
    );

    outerConeAngle
    (
        5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
		5.0
    );
}

reflectCoeffs
{
    elasticity      0.9;
}

// ************************************************************************* //
