master/cases/halle/2D/spray_4/ico_spray/system/probesDict
/*-------------------------------*- C++ -*---------------------------------*\
|    =========                                                              |
|    \\      /     OpenFOAM  1.4.1                                          |
|     \\    /                                                               |
|      \\  /       The Open Source CFD Toolbox                              |
|       \\/                                        http://www.OpenFOAM.org  |
\*-------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          probesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Fields to be probed. runTime modifiable!
fields
(
    p
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (0.0 0.0 -0.3)
    (0.0 0.0 -0.9)
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
